print{
 deg_Printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
 hx_printk("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
	 
//JSON-----------------------START:

//JSON-------------------------END

 //JSON-TIPS：某些客户不需要升级后自动格式化功能
}

Avora{ 
OR1K_GCC_PATH = r'D:\ChenJianShun\02_software\24_toolchain\hx330x-gcc-elf-newlib-sf-mingw-V4.9.1\bin'
XUANTIE_900_GCC_PATH = r'D:\ChenJianShun\02_software\24_toolchain\Xuantie-900-gcc-elf-newlib-mingw-V3.0.1\bin'
}

读盘模式{
	u32 usb_mode;
	res_image_show(R_ID_IMAGE_PCCAM_MODE, 1);
	usb_mode = USB_DEVTYPE_COMBINE;
	usbDeviceOp.ui_show_state = 0;
	task_com_sound_wait_end();

	dusb_api_Init(usb_mode);
	usbDeviceOp.usb_process_flag = 1;
}

other{
	git reset --soft HEAD^
	Cjs416@JSON
}

项目{	
	20260425{
		1,DC228C;
		2,0204;
		3,H0634;
		4,H0694;
		5,H0892;
		6,X5005;
		
		X5005,DC228C,H0892;
	}
	
	20260514{
		1,DC228C;
		2,0204;
		3,H0892;镜头，时间；
		
		先处理0204，搞定一个；
		搞定了，哈哈哈；
	}
	
	20260519{
		H69;
		DC228;
		H0892;
		sy02;完成；
		0204;完成；
		
		DC228在做，H69等待，H0892暂停；
	}
	
	20260520{
		在做：DC228;
		等待：H0892;
		暂停：
	}
}

金子{
	1141.24 * 0.1 = 114.124;
	1141.24 - 114.124 = 1027.116;
	
	1247x10%=124.7;
	1247-124=1123;
}

待购买的东西{
	1、两双运动鞋；
	2、远程开机设备（分享）；
	3、裤子；
}

电池{
	//0 <= b < 1:关机
	//1 <= b < 2：BATTERY_STAT_1
	//2 <= b < 3：BATTERY_STAT_2
	//3 <= b < 4：BATTERY_STAT_3
	//4 <= b < 5：BATTERY_STAT_4
}

独白{
	在持续混乱中，依然能维持秩序感；
	执行模式改为调度模式；
	一段时间只推进一个核心任务
	统一回复消息
	给自己连续专注时间
	哪些在做
	哪些等待
	哪些暂停
	哪些需要反馈
	哪些先给阶段结果
}



DC228C颜色{
	蓝色：30,144,255，1e90ff
	黄色：255,224,0,ffe000
}

DC228C 问题{	
	20260521{
		已完成：1,2，3，4,5,6,9，11，12，13，14，15,16，17,18,19，20，
		等待客户确认：7,8,
		未完成：10，21，
		开始处理,
		原厂处理：10，
		
		先处理简单的，易处理的；
		处理中：
	}
	
	20260521{
		1、无文件改成No files;//修改多国语言；
		2、变焦效果；//一个个确认；
		3、开机识别卡速度；//问原厂；
		//4、那个删除弹窗；//已完成；
		5、sd卡盘符；//问原厂；
		6、日期时间；//做菜单；
		//7、vga速度；//可取消；
		8、笑脸侦测、笑脸拍照功能；//做菜单；
		9、特效；//做菜单；
		}

		{
		已完成：1，3，4，6，8，9，
		未完成；5，
		待客户确认：2，
		先处理：8，9，
		需要时间：8，9，
		原厂：3，5，
		}
		
		录像菜单{
			1、录像分辨率；
			2、曝光补偿；
			3、摄影效果；//待做
			4、语言；
			5、设置时间；
			6、自动关机；
			7、光源频率；
			8、音效；
			
			9、格式化；
			10、默认设置
			11、版本号；
		}
		
		拍照菜单{
			0、拍照分辨率；
			1、防手抖；
			2、脸部检测；
			3、笑脸抓拍；
			4、曝光；
			5、ISO；
			6、特效；
			7、语言；
			8、日期；
			
			9、自动关机；
			10、光源频率；
			11、音效；
			12、格式化；
			13、默认设置；
			14、版本号；
		}

	客户问题{
		1，那个界面的No videos；
		4，那个删除弹窗，帮忙拍照看看；
		5，原厂反馈不支持不显示sd卡盘符，如果一定要做，拍个对比机的视频过来，我反馈给原厂（我的对比机读不到flash）；
	}
}

H0892项目{
	1、上下反转；ok;
	2、时间日期修改；
	3、效果优化；
}

H69问题{
	1、颜色；完成；
	2、移动侦测；完成；
	3、西班牙语；完成；
	4、屏闪；
	5、版本号改了；完成；
}



	







