JSON{
	ctrl + E:打开/关闭远控；
	git rm -r --cached//删除已commit的文件；
	
//JSON---------------------start:
//JSON---------------------end:
	
deg_Printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
}

待做{
	1、windows隐藏的文件默认显示；
}

独白{
	relax，relax，relax，
	听庞工的，提了意见就可以了，在其位，谋其政；
	但是我感觉想的太简单了，越急，越是要慢，要冷静；
	SDK版本混乱；
	到手的是很不稳定的SDK，项目可能要失败；
	休息，休息，happy，happy，
	2day，2day，
}
	
提测流程{
	1、修改需求；
	2、关闭串口打印；
	3、发送SDK压缩包，拿到svn编号；
	4、命名固件，发送邮件给测试；
}

周报流程{
	1、填写周报；
	2、发邮件给庞建文，抄送给蒋勇和李满华（project），注意，需要抄送给project账号；
}



项目注意事项{
	固件、SDK命名：主控型号+项目名+版本号+SVN号+日期；
	测试通过，才算结束；
	改动需要发邮件回复；
}


800张图片{
	C:\Users\jianshun.chen\Desktop\temp\2
	C:\Users\jianshun.chen\Desktop\temp\1
}

MKL-ES09C-LT{
	反馈问题：
	1、删除800张照片会重启；
	2、录像时间和回放时间不一致，且回放出现破图、快进、卡顿的情况；
	3、720P视频回放屏幕闪烁；未复现，暂不处理；
	
	复现情况：
	1、已复现；
	2、电脑时间是21分钟，回放显示是9分54s，概率复现到破图，快进；bug需修复；
	3、未复现，暂不处理；
	
	需要处理：2、
	正在处理：
	处理完成：1、
	不需要处理：3、
}

SDK分支{
	frimware_MKL-ES09-LT
}

MKL-ES09-LT修改点{
	1、添加录像缓存buf，优化写卡速度慢时，丢帧的问题；
	2、去掉写卡速度慢时，插帧的功能（会导致视频画面异常）；
	3、添加删除大量照片时，超过8s，电子狗复位的问题（删除时间每超过2s，喂一次狗）；
}

测试反馈问题{
	无卡拍照，随机性图花；
	拍照大于1000数量，在回放处全部数量显示不全；
	版本日期未更新
}

需要添加的东西{
	1、垃圾桶；
	2、扩展坞；
	3、type C充电口；
	4、镊子；
}

优化问题点{
	2.录像时间与回放时间不一致,且回放出现破图、快进、卡顿的情况。---未修复，还是会出现卡顿
	3.720P视频回放屏幕闪烁。 ---未修复
	4、无卡拍照，随机性图花；
	5、拍照大于1000数量，在回放处全部数量显示不全；
	6、版本日期未更新
	
	2、客户已接受，类似的效果；
	4、未复现，可能是硬件问题，不处理；
	
	未处理：
	先处理：
	
	不需要处理：2、3、4、
	已处理：2、3、4、5、6、
	
	
	2.录像时间与回放时间不一致,且回放出现破图、快进、卡顿的情况。---未修复，还是会出现卡顿
	3.720P视频回放屏幕闪烁。 ---未修复
	4、无卡拍照，随机性图花；
	5、拍照大于1000数量，在回放处全部数量显示不全；
	6、版本日期未更新
	
优化问题点：
拍照大于1000数量，在回放处全部数量显示不全；
版本日期未更新

暂不处理，等待客户确认：
录像时间与回放时间不一致,且回放出现破图、快进、卡顿的情况。---未修复，还是会出现卡顿//待客户确认
720P视频回放屏幕闪烁。 ---未修复//待客户确认
无卡拍照，随机性图花；//未复现
}

MKL-ES09-LT问题{
	庞工，MKL-ES09-LT新提了一些问题，其他问题都已处理，但是有个720P的回放，显示会异常，
	这边也没什么思路，丁工的机器720P，回放是正常的，ES09 1080P测试也是正常的，
	文件比较多，要逐一对比的话，可能需要比较多的时间。
	
	庞工，MKL-ES09-LT新提了一些问题，其他问题都已经处理了。
	目前还有一个720P回放显示异常的问题，我这边目前还在定位，暂时没有找到明显的原因。
	丁工的机器ES06 720P回放是正常的。
	ES09用1080P测试，在回放是正常的，720P在电脑上是正常的，720P只是在回放显示异常。
	目前看可能需要进一步对比异常和正常的回放文件。文件比较多，如果逐一对比，可能需要一些时间。
	我这边先继续排查，有进一步结果再同步。
	
	庞工，MKL-ES09-LT新提了一些问题，其他问题都已经处理了。
	目前还有一个720P回放显示异常的问题，我这边目前还在定位，暂时没有找到明显的原因。
	丁工的机器ES06 720P回放是正常的；ES09用1080P测试，回放也是正常的；720P文件在电脑上播放正常，目前看是720P文件在设备回放显示时存在异常。
	目前可能需要进一步对比异常和正常的回放文件。文件比较多，如果逐一对比，可能需要一些时间。
	我这边对SDK相关流程还在熟悉，如果有之前类似问题的排查思路或者相关经验，也希望能帮忙提供一下，我这边可以结合着继续定位。
	我这边先继续排查，有进一步结果再同步。
}

申请时间定位bug{
	同一个SDK新建的项目，E06可以，E08、E09不行。
	我想申请一天半的时间，确认具体是什么原因造成的。
	谁维护的项目，什么时候开始有问题的，我想申请版本确认。
	
庞工，目前确认到同一个 SDK 新建的项目，E06 是正常的，但 E08、E09 存在问题。
我想先申请一天半的时间，重点确认一下具体是什么原因导致的。
现在还需要进一步确认项目版本、项目维护情况以及问题是什么时候开始出现的。
另外想确认一下这几个项目之前分别是谁维护的，以及大概从哪个版本开始出现问题。
我这边想申请一下相关版本进行对比确认，这样定位起来可能会更快一些。

	庞工认为需要花太多时间，希望直接在E06上修改；
}

移植ES09到ES06{
	尽可能少修改ES06的代码，并ES09功能正常；
}

生成字符串的步骤{
	1、修改font.lsx;
	2、使用excel_to_txt.exe将exel分解成多个txt文件；
	3、如果有新增行，对比修改font.tab，这是excel的第一列；
	4、如果有新增列，对比修改font.ini，这是excel的第一行；
	5、运行resource/font/fontSrc.bat，生成fontSrc.txt；
	6、运行resource/font/font_build.exe,选择字符文件fontSrc.txt ,生成resource/font/font.bin；
	7、运行resource/font/maxRes.bat，生成\resTable\resfont.bin, \resTable\resfontidx.bin, user_str.c, user_str.h；
	8、运行resource/GenRes.bat，生成RES.bin ,RES.h；
}

生成图标的步骤{
	1、修改icon的图标；
	2、运行resource/icon/OSDEdit.exe，生成OSD_source.tmp；
	3、运行resource/icon/maxRes.bat，生成\resTable\OSD_source.bin，\restable\palette.bin，user_icon.c，user_icon.h，r_palette.h；
	4、运行resource/GenRes.bat，生成RES.bin ,RES.h；
}
 
MKL-ES09-LT修改点{
	 1、优化回放闪烁的问题，已完成；
	 2、1080P录像黑屏，客户不好复现，已忽略；
}

MKL-ES09-LT问题{
	在录像分辨率为1080P录像中出现屏幕抖动，播放中画面卡顿、进度条加速、最后1秒画面卡住时长缓慢；已完成；
}

一帧{
	8x64=512;
}

MKL-ES09-LT修改点2{
	在录像分辨率为1080P录像中出现屏幕抖动，播放中画面卡顿、进度条加速、最后1秒画面卡住时长缓慢；
	已完成（确认录像预览不卡顿，视频不卡顿）；
}

打印相机{
	1、怎么实现的打印功能，是否用一些通用的协议；
	2、如何实现的切换摄像头；
	3、回放如何实现的打印；
}

如何实现的打印功能{
	通过打印头和打印电机的配合完成，需要两个外设；
	打印头：串行移位寄存器协议；
	打印电机：并行电平控制；
	打印头接口：J10 PT48DS-B 24PIN
	送纸电机：U4 HR8833
}

串行移位寄存器协议{
	串行移位：clock + DI;
	锁存：LATCH，将一行移位寄存器数据传输给锁存寄存器数据；
	使能加热：STB，加热需要显示的数据；
	同步：TM，配合走纸和加热；
}










