独白{
	感觉有点累了，老妈回老家了，为什么会累呢，
	没有很累，但是不开心，太持续了，或者思考太多了，
	身病易治，心病难医；
	是心净了，是更专注了，开始思考了； 
	思考最不需要时间，因为只需一瞬；
	又最需要时间，因为需要积累；
	挺烦的，时间是相对而言的；
	其实世界都是矛盾的，给世界一个理由，给自己一个理由；
	现在已经拥有很多了，稳定的发展；
	有的时候想玩游戏，有的时候想睡觉，有的时候想看视频，有的时候想学习，有的时候只想发呆；
	对能让自己开心，但有代价的事情，延迟满足，
	我需要方向，
	已经从工作泥潭中出来了，但是这些时间不知道怎么处理，
	这个方向，既能满足当下的需要，又要符合长远的发展，
	无非是学和玩，
	工作压力还是比较大，控制工作外的时间，
	周一到周四，游戏时间，
	周五到周日，学习时间，
	都不知道玩什么，学倒是有个方向，
	玩的目的是放松，其实也不知道，
	我觉得有问题，
	不是每个小时都要产生价值，而是让大多数时间，都在为未来的自己积累价值。
	我希望长期保持在这个领域里，不因为几天状态差就彻底退出。
	
}

json{
	常用密码：Cjs416@JSON
	
	uu密码：Cjs416JSON
	
	多屏移动窗口：win+shift+左移按键；
}

目标{
	可调整，正在尝试的目标{
		1、学学英语{
			一周学7个词汇；
			20260420：在坚持；
			20260512：在坚持；
			20260706：已结束；
		}
		2、通关这是我的战争{
			目标：通关我的战争；
		}
	}
	四目标{
		1、积累经验；短期目标；
		2、成为管理；一阶段目标；
		3、成立公司；二阶段目标；
		4、成立国家；三阶段目标，最终目标；
	}
}

投资{
	投资{
		每月：20%-30%；2600-3900；
		宽基指数：2600x0.3=780；
		黄金：2600x0.4=1040
		铜：2600x0.3=780;
	}
	
	计算{
		（1247-1031）/ 1247=17%；
		| 回撤      | 参考     |
		| ------- | ------ |
		| <5%     | 不便宜    |
		| 5%~10%  | 可以慢慢买  |
		| 10%~15% | 偏合理    |
		| >15%    | 可能明显回调 |
		
		20%：定投；
		30%：投入1到1.5；
		50%：投入1.5到2；

	}
}

vsode AI插件{
	GitHub Copilot Chat
	GitHub Copilot
}

这是我的战争{
	什么时候需要结束{
		1、人物死亡；
		2、人物崩溃；
	}
	每日必做{
		早上安排人睡觉（交易姐优先）；
		商人在12点前过来（需要交易获得的东西：木头，组件，火材，水，糖，食物，）；
		11天，吃饭；
		11，13，15，17，19，21，23，25，27，29，31，33，35.37，39，41，43，45，
		18号探索，
		18，21，24，27，30，33，36，39，42，45
		每日白天记录{
			1，需要制作的东西，需要的材料；
			2，今天吃饭的情况；
		}
		每日晚上记录{
			1，记录外界的情况；
			2，记录晚上的交易情况；
		}

	}
	状态信息{
		吃饱，	饥饿，	 非常饥饿，饥饿难忍，	饿得要死，
		正常，	疲劳，	 非常疲劳，精疲力尽，
		健康，	小病，	 生病，	   重病，		病入膏肓，
		健康，	小伤，	 受伤，	   重伤，		致命伤，
		满足， 	无状态， 悲伤，	   沮丧，		崩溃，
		高危组合：非常饥饿+悲伤；寒冷+小病；
	}
	当前进程{	
	奇数吃饭，每3天探索；
	}
}

西奥小镇{
	
	分布{
		住宅区

		商业区

		主干道

		工业区
	}
	
	比例{
		住宅 : 商业 : 工业
		≈
		6 : 2 : 3
	}
	
	居民区{
		6×6
		8×8
	}
	
	商业区{
		3×3
		4×4
		6×3
	}
	
	工业区{
		6×4
		8×4
	}

}

歌单{
	一点，
	清空，
}

休息时间{
	工作时间：3+6.5=9小时30分；
	睡眠时间：00：30-7：30 +20；7小时20分；
	运动时间：中午20，晚上20分钟；40分钟；
	游戏时间：中午20，晚上40分钟；1个小时；
	通勤时间：3小时；
	18小时30分
	21小时30分
	剩余2小时30分
}

地址{
	收件人: 陈先生
	手机号码: 18617945584
	所在地区: 广东省深圳市龙华区大浪街道
	详细地址: 福轩新村93栋501
	
	广东省深圳市龙华区大浪街道福轩新村93栋501
}

主管{
	有能力，
	展现自己，甚至诱导别人给自己付费，
	表现太用力，
	支持别人，却不想付出代价，
	说一套，做一套，虚伪，
	想要获得，又不想付出，pua别人，让别人奉献，
	私心太重，
	
	我需要双赢，长期稳定的关系；
	他会疯狂占我便宜，诱导我付出，不给实际回报，
	最大的问题，一旦不满足他，他会pua，这种会让人难受，
	自大，轻视别人，不在乎别人的利益，只在乎自己，
	短视。
}

应对客户{
	1、确认需求
	{
		需要流媒体功能送样；
		屏是不是一样的，
		IO口是不是一样的，
		如果是一样的，尝试点亮；
		
		因为主板不一样，配置也不一样，需要修改软件，具体时间还需要，我这边会尽快给出来；
	}
	2、恢复客户
	{
		这个功能目前缺少对应硬件，暂时无法进行有效验证。直接盲调的话，效果无法确认，后续拿到硬件后也可能需要重新调整，所以目前不建议在没有硬件的情况下直接开发。
		这个功能目前没有对应硬件，调完之后没法确认实际效果。即使先按理论参数调整，后续有硬件后也可能需要重新验证和修改，前面的工作可能还要重复。
		为了避免反复投入时间，建议还是等硬件到位后再处理。
	}
}

{
	老板，我想了解下最近的项目安排,秦总他们希望流媒体3506f，3508E交给他们公司开发；
	但是这两个还没有开发完全，确实还有难度，交给他们的话，可能还需要我们花大量时间支持；
	我是希望先把他们公司，3302，3303的项目交给他们，这些方案已经成熟稳定，他们也能在这段时间熟悉sdk；
	可以后面再接手比较复杂的开发；
	
	老板，我想了解一下最近的项目安排。
	秦总他们希望把流媒体3506F、3508E交给他们公司开发，但这两个项目目前还没有完全开发完成，技术上还有一定难度。
	如果现在交接，前期可能还需要我们投入较多时间支持，实际分担效果可能有限。
	我个人建议，可以先把3302、3303这类方案比较成熟、稳定的项目交给他们，让他们先熟悉SDK和相关开发流程。
	等他们熟悉一段时间后，再逐步接手3506F、3508E这类复杂项目，这样交接可能会更顺利一些。

}








 
