JSON{
	ctrl + E:打开/关闭远控；
	git rm -r --cached//删除已commit的文件；
	
//JSON---------------------start:
//JSON---------------------end:
	
printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
deg_Printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
uart_Printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
}

待做{
	
}

独白{
	追求就是吃吃喝喝，健健康康；
	给我看爽了；
}
	
提测流程{
	1、修改需求；
	2、关闭串口打印；
	3、发送SDK压缩包，拿到svn编号；
	4、命名固件，发送邮件给测试；
}

周报流程{
	1、填写周报；
	2、发邮件给庞建文，抄送给蒋勇和李满华（project），注意，需要抄送给project账号；
}

发邮件流程{
	1、确认修改点是否添加；
	2、确认压缩包大小是否正常；
}

项目整理{
	待处理：
	MKL-ES09C-LT，测试问题，客户问题；
	Y200-DV04-LT, 摄像头不亮；
	JDK-SD3166，删除界面时 语言。英文，显示不全（详情查看附件视频）
	
	等待中：
	等待硬件：
	SD-PK01J，
}




项目注意事项{
	固件、SDK命名：主控型号+项目名+版本号+SVN号+日期；
	测试通过，才算结束；
	改动需要发邮件回复；
}

需要添加的东西{
	1、垃圾桶；
	2、扩展坞；
	3、type C充电口；
}

生成字符串的步骤{
	1、修改font.lsx;
	2、使用excel_to_txt.exe将exel分解成多个txt文件；
	3、如果有新增行，对比修改font.tab，这是excel的第一列；
	4、如果有新增列，对比修改font.ini，这是excel的第一行；
	5、运行resource/font/fontSrc.bat，生成fontSrc.txt；
	6、运行resource/font/font_build.exe,选择字符文件fontSrc.txt ,生成resource/font/font.bin；
	7、运行resource/font/maxRes.bat，生成\resTable\resfont.bin, \resTable\resfontidx.bin, user_str.c, user_str.h；
	8、运行resource/GenRes.bat，生成RES.bin ,RES.h；
}

生成图标的步骤{
	1、修改icon的图标；
	2、运行resource/icon/OSDEdit.exe，生成OSD_source.tmp；
	3、运行resource/icon/maxRes.bat，生成\resTable\OSD_source.bin，\restable\palette.bin，user_icon.c，user_icon.h，r_palette.h；
	4、运行resource/GenRes.bat，生成RES.bin ,RES.h；
}

Y200-DV04-LT项目{
	Y200-DV04-LT项目
	因为两个摄像头的方向不一样，屏的方向是固定的，所以后路的摄像头，在屏上预览会镜像，现在有两个处理方式：
	1、在后路时，保持屏显预览镜像，拍照和录像文件正常；
	2、让后路摄像头镜像，屏预览显示正常，但是拍照和录像文件也会镜像；
}

temp{
	白左，手机右
}

朱迪问题{
	 朱迪C3软件有问题，
	 1.屏颜色发红，Ui图标失真色彩不对。
	 2.录像拍照移动，镜相180度反，
	 3.拍照录像效果不清晰。
	 4，拍照不要闪光灯。需要去掉。
	 5，(游戏)打开里面是拼图功能。对不上功能。
	 6，机身内存拍照默认24张不对。需要修改对应大货30张
	 
	 1：考虑屏显偏红；
	 2：修改镜像问题；
	 3：提高录像和拍照质量；
	 4：去掉闪光灯图标；
	 5：游戏是什么功能，刷之前的软件确认；
	 6：减少flash占用；
	 
	 已经处理：2，4，5，6，
	 优先处理：
	 未处理：1，3，
}

客户反馈{
	1、改了屏的没有问题；
	2、上周六点摄像头有很多问题；
}

屏显问题{
	相对于改屏（草莓熊主题的软件，版本号10月10号出的软件v001-v004），
	客户提的六个问题都是有的，可能是对比的之前的软件（之前sdk可能有更新）；
}

周报提交{
	SD3166-JDK   项目，客户提的问题和客户提出的问题，都已处理，暂无反馈；
	MKL-ES09C-LT 项目，客户直接到现场对接，问题已处理；
	Y200-DV04-LT 项目，问题处理中；
	SD-PK01J     项目，等待处理中；
	
SD3166-JDK 项目：客户提出的问题均已处理完成，目前暂无进一步反馈。
MKL-ES09C-LT 项目：客户到现场进行对接，相关问题已处理完成。
Y200-DV04-LT 项目：相关问题正在处理中。
SD-PK01J 项目：当前等待处理中。
}

SD-PK01J 项目{
	1、屏颜色显示异常；
	2、按键功能不全；
	3、蓝灯，红灯，补光灯功能待确认；
	
	1：已解决；
}

按键功能{
	正面四个按键：
	1、左上 缩小键：value：0；
	2、左下 放大键；value：412-420；
	3、右上 快门键；value：319-329；
	4、右下 模式切换键；value：130-136
	
	侧面上个按键
	5、左1 开机键；
	6、左2 回放键；683-690；
	7、左3 菜单键；507-516；
	
	拍照界面，录像界面，回放界面；
	mode按键要切换录像和拍照；
	video按键要 切换拍照和回放 
	menu键要实现菜单功能，并取消回放功能；
}

Y200-DV04-LT 项目{
	Y200-DV04-LT 项目提测：
	1、自拍的镜头镜像-------已完成
	2、屏幕颜色偏色（换屏驱）-------已完成
	3、硬性要求，30张-------已完成
	
	先测试朱迪主题，没有问题，发出其他固件；
	
	已处理：1，2，3，
	未处理：
}

提测需要{
	尽早的把软件给到测试，不要拖延；
}

手持DV需求{
	这个是手持DV的公版SDK；
	我想知道这个是谁发布的，能不能提供支持；
	想确认是否有机器用这个sdk，正常拍照录像；
	我想拿到机器，对比差异；
}

Y200-DV04-LT 项目提测{
	Y200-DV04-LT 项目提测：
	1、设备连接PC，打开摄像头、U盘后，再断开PC连接，设备会出现绿色花屏；------已处理；
	2、硬性要求，30张------已处理；
}

自说自话{
	一开始是有问题的，不要为难自己，尽早给软件出来；
	别害怕，别担心，都有一个适应的过程；
	找对方向，努力前进吧；
}

Y200-DV04-LT 项目提测{
	Y200-DV04-LT 项目提测
	优化无卡拍照，最终数量大于30的问题；
}

SD-PK01J 项目提测{
	SD-PK01J 项目提测
	1、按立项表点亮屏和摄像头；
	2、按立项表添加按键功能；
	3、按立项表添加补光灯和录像电灯；
}

Y200-DV04-LT 项目提测{
	Y200-DV04-LT 项目提测
	1、修改同朱迪主题；
	2、米妮、米奇、草莓熊主题；
}

表面{
	表面的善良也因该鼓励，甚至让他变形，最终成为助力，团结一切可以团结的；
}

SD-PK01J 项目问题{
1. 图片/预览画面四角偏色
2. 录像的计时不变
3. 在pc查看，拍出的图片变形
4. 画面过曝
5. 延时摄影无法保存录像
6. 切换阿拉伯会导致在设置页面卡死
7. 开启音量后的第一声操作音比后续声音高

1：-------等待ISP处理；
2：
3：
4：-------ISP处理；
5：去掉延时摄影菜单；
6：去掉阿拉伯语；
7：
先处理：
稍后处理：

其他处理：
ISP处理：1，4，

未处理：1，4，
已处理：2，3，5，6，7，
}

比例{
	1280：720；
	x：1080；
	
	1280：720；1920:1080分别是几比几
	1280x1080/720
}


屏驱动{
	0x22,
	0xCD,
	
	0x14,//20
	0xBF,//191
	
	0x19,//25
	0xC3,//25+170,195
	
	0x1E,//30
	0xC9,//201
	
	0x20,//32
	0xCB,//203
	
	0x21,//33
	0xCC,//204
}

分辨率{
	172:320;
	387:720;
	581:1080;
	774:1440;
	1161:2160;
}

SD-PK01J 项目提测{
	SD-PK01J 项目提测，
	1. 图片/预览画面四角偏色-------等待ISP处理；
	2. 录像的计时不变-------已处理
	3. 在pc查看，拍出的图片变形-------已处理
	4. 画面过曝-------等待ISP处理；
	5. 延时摄影无法保存录像-------已去掉该菜单
	6. 切换阿拉伯会导致在设置页面卡死-------已去掉该多国语言
	7. 开启音量后的第一声操作音比后续声音高-------已处理
	
	
	2，3，7，已处理；
	5，6，该项目不需要这些功能；
	1，4，等待ISP同事处理；
}

SD-PK01J 项目提测{
	SD-PK01J 项目提测，
	2. 录像的计时不变-------已处理
	3. 在pc查看，拍出的图片变形-------已处理
	7. 开启音量后的第一声操作音比后续声音高-------已处理
	5. 延时摄影无法保存录像-------已去掉该菜单
	6. 切换阿拉伯会导致在设置页面卡死-------已去掉该多国语言
}

SD-PK01J 项目提测{
	SD-PK01J 项目提测，
	1、只保留中文和英文；
	2、添加H63P的优化效果；
}

美国阶级{
	1、工资更高，可以从其他国家获取生产的物品，而不需要提供劳动；
	2、阶级更固化；
	
	拥有资源分配权，肯定会影响私人生活；
	但是对权力没有限制，就会加大这种影响；
	国内的职员是更有话语权的；
	权力在有能力的人手里，没有价值会离开抛弃；
	完全没有感情，反而倒逼无能（失败）的人退出；
	喜欢说话好听的，但是项目一直失败，市场有可能倒逼企业退出；
	美国管理者一定比中国管理者拥有更多权力，更严重影响生活；
	但是美国有加班1.5倍工资，倒逼管理者减少加班；
	而国内不需要付出这个代价，管理者让员工加班，稳赚不亏；
	决策背后都是利益计算；
}

软件结论{
	1、验证falsh是否会引起复位不能开机；
	2、客户判断GAVDD口，复位有3.3v电压，导致不能开机（屏幕不亮）
	
	升级的固件是一样的，一个复位可以开机，一个复位不开机，没有异常的打印；
	怀疑是屏IO口，硬件短路；
}

自说自话{
	累，
}

验证{
	1、开机到lcd_init，一直是低的；
	2、lcd_init拉高，确认机器屏显是正常的；
}

解决问题尝试{
	1、降低flash SPI的波特率（从12M到1M）；
	2、降低屏驱动频率 （PLL_CLK/(240*320*2*60)/2到PLL_CLK/(240*320*2*10)/2）；
	3、在启动配置前，通过写寄存器关闭VDD_GSEN；
	4、开机屏显正常后，关闭VDD_GSEN；
}








