JSON{
	ctrl + E:打开/关闭远控；
	git rm -r --cached//删除已commit的文件；
	
//JSON---------------------start:
//JSON---------------------end:
	
printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
}

待做{
	
}

独白{
	追求就是吃吃喝喝，健健康康；
	给我看爽了；
}
	
提测流程{
	1、修改需求；
	2、关闭串口打印；
	3、发送SDK压缩包，拿到svn编号；
	4、命名固件，发送邮件给测试；
}

周报流程{
	1、填写周报；
	2、发邮件给庞建文，抄送给蒋勇和李满华（project），注意，需要抄送给project账号；
}

发邮件流程{
	1、确认修改点是否添加；
	2、确认压缩包大小是否正常；
}

项目整理{
	待处理：
	MKL-ES09C-LT，测试问题，客户问题；
	Y200-DV04-LT, 摄像头不亮；
	JDK-SD3166，删除界面时 语言。英文，显示不全（详情查看附件视频）
	
	等待中：
	等待硬件：
	SD-PK01J，
}




项目注意事项{
	固件、SDK命名：主控型号+项目名+版本号+SVN号+日期；
	测试通过，才算结束；
	改动需要发邮件回复；
}

需要添加的东西{
	1、垃圾桶；
	2、扩展坞；
	3、type C充电口；
}

生成字符串的步骤{
	1、修改font.lsx;
	2、使用excel_to_txt.exe将exel分解成多个txt文件；
	3、如果有新增行，对比修改font.tab，这是excel的第一列；
	4、如果有新增列，对比修改font.ini，这是excel的第一行；
	5、运行resource/font/fontSrc.bat，生成fontSrc.txt；
	6、运行resource/font/font_build.exe,选择字符文件fontSrc.txt ,生成resource/font/font.bin；
	7、运行resource/font/maxRes.bat，生成\resTable\resfont.bin, \resTable\resfontidx.bin, user_str.c, user_str.h；
	8、运行resource/GenRes.bat，生成RES.bin ,RES.h；
}

生成图标的步骤{
	1、修改icon的图标；
	2、运行resource/icon/OSDEdit.exe，生成OSD_source.tmp；
	3、运行resource/icon/maxRes.bat，生成\resTable\OSD_source.bin，\restable\palette.bin，user_icon.c，user_icon.h，r_palette.h；
	4、运行resource/GenRes.bat，生成RES.bin ,RES.h；
}

.gitignore{
	demo\helloftv\.codelite
	demo\helloftv\Debug
	output
	demo\helloftv
	
	demo/helloftv/.codelite/
	demo/helloftv/Debug/
	output/
	demo/helloftv/AX3292-hello.mk
}

JDK-SD3166提测1{
	提测：
	1、优化按下键，显示菜单的问题；
}

JDK-SD3166编号{
	SVN2616
	svn2617
	SVN2619
}

JDK-SD3166提测2{
	提测：
    1.设备无卡状态时，拍完照片后，在设置里进行格式化，按确认键无效；-------已处理
    2.设备有卡状态时，拍完照片后，在设置里进行格式化，格式化失败且检测不到TF卡；--------沟通确认是卡的问题
    3.在设置模式下，进行时间设置，小月和2月可以设置31号；--------已处理
}

JDK-SD3166提测3{
	提测：
	3、在设置模式下，进行时间设置，小月和2月可以设置31号；--------已处理
	4、设备无卡状态时，拍完照片后，在设置里进行格式化，相册中的照片未能格式化掉；--------已处理
}

撕裂{
	1、mipi屏可以使用vsync优化，主控DSI需要支持DSI_EVENT_VSYNC；
	2、降低屏幕刷新率；
	3、主控能产生 RGB/MIPI 时序，同时会产生 VSYNC 中断；
}

客户沟通技巧{
	我没有修改，首先就没有提这些问题，确认权力和责任，不该背的锅不背；
	客户容易放大一些事情，争取自己的道德高地；
}

客户需求{
	1、更换开关机logo-----已处理，老软件正常；
	2、初始默认语言要英文，目前是中文的；-------已处理，老软件异常；
	3、放大缩小没显示倍数；如X200,X400 -------已复现，老软件正常；
	4、拍照速度有点慢； --------已复现，老软件异常；
	5、开机时会自动拍照；--------已复现，老软件异常；
	6、照片删除后 不会自动跳到下一张 ------- 已复现；
	
	已处理：1，2，3，5，6，
	正在处理：
	问同事：4，
	稍后处理：
	
	5：开机时响应了power键，希望开机的时候忽略掉；
	
	3、判断是否是修改引起的；
	4、拍照慢，怎么处理，没有思路；
}

20261014项目{
	10月14日        软件三组        陈建舜        JDK-SD3166 -------处理中，预计今天完成
}

ES09C问题{
	1、未插卡拍照显示“SPI已满”。不能拍照。进入回放查看却是没有文件。（格式化之后才能重新不插卡拍照；
	2、产品开机状态插入充电线死机，然后就“复位”进入充电模式。（没有关机画面）
	3、拍照时间标签的关闭无效，关闭后拍照出来的文件还是有时间戳。
	4、录像文件回放轻微花屏（应该与压缩比有关系）
	5、格式化后在进入别的设置界面会自动返回（例如先格式化之后，选择恢复出厂设置进入下级菜单立马返回主菜单了。需要在操作确认才能进入子菜单操作）
	6、未插卡进入回放，不是之前拍照的文件，而是进入回放前屏幕最后的画面。翻动其他文件全是黑屏。
	且当前翻动停留的位置，切换拍照、录像在回到回放模式还是当前位置。（例如现在翻动到5/8的位置黑屏，
	切换模式回到回放模式文件位置还是5/8但是画面变成了前面切换到拍照模式最后的画面）
	7、产品拍照、录像出来的文件的效果整体不好，是否压缩的太高。参考ES06A(LT)的设定即可
	8、拍照、录像的文件在电脑端查看变扁。
	9、开机后连接电脑进入磁盘模式，拔掉数据线画面卡死，然后“复位”（跟开机充电的情况一样）
	
	已处理：1、2、3、4、5、6、7、8、9、
	同事已有处理：
	未处理：
	
}

提交{
	1、更换开关机logo-----已处理
	2、初始默认语言要英文，目前是中文的；-------已处理
	3、放大缩小没显示倍数；如X200,X400 -------已处理
	4、拍照速度有点慢； --------怀疑是flash问题，暂未处理
	5、开机时会自动拍照；--------已处理
	6、照片删除后 不会自动跳到下一张 ------- 已处理
	
	SVN2621
}

谭工{
	3、5、7、8、
}

对不上{
	H23400-XJQ-A;
	ST2605-X100-6.5x6.5-20A6-Y1;
	H23087-A;
	ST2407-X100F-20A6-Y2;
}

摄像头{
	20A6,
	模组点不亮，
}

ES09C提测{
	提测
	1、未插卡拍照显示“SPI已满”。不能拍照。进入回放查看却是没有文件。（格式化之后才能重新不插卡拍照；--------已处理
	2、产品开机状态插入充电线死机，然后就“复位”进入充电模式。（没有关机画面）--------已处理
	3、拍照时间标签的关闭无效，关闭后拍照出来的文件还是有时间戳。--------已处理
	4、录像文件回放轻微花屏（应该与压缩比有关系）--------未复现
	5、格式化后在进入别的设置界面会自动返回（例如先格式化之后，选择恢复出厂设置进入下级菜单立马返回主菜单了。需要在操作确认才能进入子菜单操作）--------已处理
	6、未插卡进入回放，不是之前拍照的文件，而是进入回放前屏幕最后的画面。翻动其他文件全是黑屏。
	且当前翻动停留的位置，切换拍照、录像在回到回放模式还是当前位置。（例如现在翻动到5/8的位置黑屏，
	切换模式回到回放模式文件位置还是5/8但是画面变成了前面切换到拍照模式最后的画面）--------已处理
	7、产品拍照、录像出来的文件的效果整体不好，是否压缩的太高。参考ES06A(LT)的设定即可--------已处理
	8、拍照、录像的文件在电脑端查看变扁。--------已处理
	9、开机后连接电脑进入磁盘模式，拔掉数据线画面卡死，然后“复位”（跟开机充电的情况一样）--------已处理
	
	SVN5194
}

今日项目{
	Y200-DV04-LT — 陈健舜(软件3组) ------- 客户寄过来的20a6模组无法点亮（我们的20a6模组可以），在向客户要接口定义验证
}

测试{
	提测
	9、开机后连接电脑进入磁盘模式，拔掉数据线画面卡死，然后“复位”（跟开机充电的情况一样）--------已处理
	10、无卡状态在拍照模式下，进行放大后拍照，相册查看照片出现花屏； --------已处理
	11、有卡状态在拍照模式下，进行放大拍照，在相册中查看无放大效果； --------已处理
	
	SVN5219
}

项目进度{
	软件三组        陈建舜        Y200-DV04-LT   -------需要等待客户给出接口定义确认
}

屏问题{
	JDK-SD3166屏问题：
	1、现在使用的屏（7789v）接触不良；
	2、客户刚寄过来的屏是3031B，我暂时可以用这个屏，调试测试；
	3、希望客户再安排几个7789v的屏过来；
}

MKL-ES09C-LT 项目提测{
	MKL-ES09C-LT 项目提测
	1、蓝灯异常闪烁问题；--------已处理
	2、电脑查看照片分辨率异常问题（以及回放分辨率显示异常问题）；--------已处理
	
	SVN5229
}

MKL-ES09C-LT 测试问题{
	发现问题点：

	1、关闭补光灯后，打开设置菜单再退出设置菜单，会再次自动打开补光灯；
	2、无卡拍照回放不能显示对应分辨率；
	3、有卡变焦放大拍照后，所有分辨率均显示为1M;-------未复现；
	4、在相册回放时补光灯会关闭，当插入充电后，会自动点亮补光灯；
	5、屏幕上部多次出现点亮一个红色的“R”符号；
}

个人思考{
	首先客户的问题是最重要的，其他的可以后面再看；
	优先客户问题；
}

JDK-SD3166 提测{
	JDK-SD3166 提测
	删除界面时 语言。英文，显示不全（详情查看附件视频；---------已处理
}

20261016计划{
	软件三组        陈建舜        MKL-ES09C-LT------处理中，预计今天完成
}

Y200-DV04-LT提测{
	Y200-DV04-LT提测
	1、草莓熊主题；
	2、点亮客户摄像头；
}

MKL-ES09C-LT{
	MKL-ES09C-LT
	客户测试通过；
}






