print{
    deg_Printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
    hx_printk("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
        
   //JSON-----------------------START:
   
   //JSON-------------------------END
   
    //JSON-TIPS：某些客户不需要升级后自动格式化功能
   }
   
   Avora{ 
   OR1K_GCC_PATH = r'D:\ChenJianShun\02_software\24_toolchain\hx330x-gcc-elf-newlib-sf-mingw-V4.9.1\bin'
   XUANTIE_900_GCC_PATH = r'D:\ChenJianShun\02_software\24_toolchain\Xuantie-900-gcc-elf-newlib-mingw-V3.0.1\bin'
       # ENV_NAME = 'hx350x_or1k'
       ENV_NAME = 'hx350x_riscv'
       #include "user.h"
   }
   
   读盘模式{
       u32 usb_mode;
       res_image_show(R_ID_IMAGE_PCCAM_MODE, 1);
       usb_mode = USB_DEVTYPE_COMBINE;
       usbDeviceOp.ui_show_state = 0;
       task_com_sound_wait_end();
   
       dusb_api_Init(usb_mode);
       usbDeviceOp.usb_process_flag = 1;
   }
   
   other{
       git reset --soft HEAD^
       Cjs416@JSON
       12306：Cjs416JSON
       小写转大写：
       Ctrl + Shift + U
       大写转小写：
       Ctrl + U
       cd /d D:\Projects\Test
       深圳市宝安区新安街道留仙二路D地段F栋新东兴商务中心301。陈海熊，13826597116
       AutoHotkey软件
   }
   
   一周项目{				
       20260810{
           未完成{
               Y300-XAK,//点亮
               H6365,//
           }
           已完成：
           在做：
           等待{
               等待客户{
               504A1-BH,//添加按键，等待客户确认；
               Y17-ShenDK,//3303需求，等待客户确认，
               H0694-YC,//卡顿问题，等修改车内帧率
               H0694-XAK,//点屏，
               H0654-XAK,//合3049屏驱动，
               8405-LMT-CD,//添加缩时录影；
               H0694-YC,//功能需求,
               H0694-TB,//缩时录影时间
               HP181-HC,//更新SDK，
               H0694-3lu-TB,//等待客户升级，
               GJK100-XAK,//点RGB 3.16的屏
               H0894-HC,//3508E，录像问题，
               84A3-BH,//屏的问题，
               N82-CD,//水印问题，
               H0634-HC,//ASR usb闪的问题，切到最新测试，
               N88-CD,//添加缩时录影,
               9049-35-CD,//后拉；
               84A3-newUI-BH,//卡顿
               84A3-oldUI-BH,//噪点
               84A2-BH,//
               }	
               等待硬件
               H0812-HC,//修改电压输入，
               H0620-HC,//修改电压输入，
               等待原厂
               9049-33-CD,//停车唤醒异常的问题，
               等屏厂支持
               等sensor厂支持
               N89-CD,//添加缩时录影,
           }
       }
   }
   
   金子{
       1141.24 * 0.1 = 114.124;
       1141.24 - 114.124 = 1027.116;
       
       1247x10%=124.7;
       1247-124=1123;
       
       872:2K;
   }
   
   待购买的东西{
   
   }
   
   电池{
       //0 <= b < 1:关机
       //1 <= b < 2：BATTERY_STAT_1
       //2 <= b < 3：BATTERY_STAT_2
       //3 <= b < 4：BATTERY_STAT_3
       //4 <= b < 5：BATTERY_STAT_4
   }
   
   独白{
       在持续混乱中，依然能维持秩序感；
       执行模式改为调度模式；
       一段时间只推进一个核心任务
       统一回复消息
       给自己连续专注时间
       哪些在做
       哪些等待
       哪些暂停
       哪些需要反馈
       哪些先给阶段结果
       
       首先，我应该暂停看消息，专注处理问题，
       可实现但又有挑战的新目标
   }
   
   屏IO口{
       CLK(WR) :     
       RS(HS)  :     
       CS(DE)  :     
       TE(VS)        
       --------      
       D0      :     
       D1      :     
       D2            
       D3            
       D4            
       D5            
       D6            
       D7            
   }	
   
   维护项目{
       done BH-84A3_L-FL7707_S-DVP-2083_LA-英语_P-welcome_v026_20260120-1553.rar
       done N88_1.2.6_有wifi_L-NV3049F_LA-泰语-2K_开机ASTON带logo水印_大核_优化WiFi显示_同步APP选项_20260717_v119.3
       done CD-N88-带wifi-ZTOP_L-NV3049F_LA-泰语_R-2K_P-ASTON_v1193_20260831-1648
   }
   
   
   
   华创项目{
       1、H0654,H0634换RGB屏;优先搞1，Y100,
       2、H0812,无屏，摩托车，3508E，
       3、H0620,带屏，摩托车，3506F,
       4、H0635,5路，7701，3506F,优先搞2，
       5、H0892,3508E,双分屏压缩，不读卡，
       6、H06165,3.16屏幕,
   }
   
   wifi pos组{
       wifi_clk:	PD3,
       wifi_CMD:	PD2,
       wifi_D0:	PD4,
       wifi_D1:	PD5,
       wifi_D2:	PD0,
       wifi_D3:	PD1,
   }
   
   郭总项目{
       Y17-3303,
       GJK100,3506,4lu,RGB,3.16,H0654,//改3.16的屏，
       XC403,H0635,//少一个dvp镜头，做4路，
       H0694-XAK,
   }
   
   9049问题{
       测试20260826：
       1.开机和关机画面需要改
       2.运行一段时间，屏幕出现条纹缓慢刷屏
       3.关机画面异常，出现多个byebye  并且再次开机线出现byebye
       4.点击右侧上锁按钮会自动进入录像模式，关闭上锁后无法重新打开锁问题
       5.按键操作不流畅，特别是开始结束录像和切换画面，切换后需要等待1-2秒才允许按键操作
       新增问题：
       8.界面风格能否和前3代一样，包括菜单界面
       9.菜单选项需要设计和前3代一样
       9.录像过程中点击菜单按钮无法进入菜单，需要自动保存并进入菜单
       10.喇叭声音太小，无按键提示音，开开机音乐，关机音乐
       11.文件保存目录名称和格式也需要和前3代一样
       12.USB连接电脑未弹出设备
   }
   
   王工问题{
       H06364,连不上wifi；
   }
   
   百华问题{
       注意客户定制这版本有这些需求核对下：
       1.插入新卡提示格式化卡，不要出现卡错误提示。//done
       2.提示弹窗格式化。//done
       3.充电图标不闪动。//done
       4..增加弹窗格式化，镜头上下微调，左右切换视窗。//done
       5.定制语言13国，默认英文。//done
   }
   
   9049问题{
      测试20260826：
      1.开机和关机画面需要改
      2.运行一段时间，屏幕出现条纹缓慢刷屏
      3.关机画面异常，出现多个byebye  并且再次开机线出现byebye
      4.点击右侧上锁按钮会自动进入录像模式，关闭上锁后无法重新打开锁问题
      5.按键操作不流畅，特别是开始结束录像和切换画面，切换后需要等待1-2秒才允许按键操作
      新增问题：
      8.界面风格能否和前3代一样，包括菜单界面
      9.菜单选项需要设计和前3代一样
      9.录像过程中点击菜单按钮无法进入菜单，需要自动保存并进入菜单
      10.喇叭声音太小，无按键提示音，开开机音乐，关机音乐
      11.文件保存目录名称和格式也需要和前3代一样
      12.USB连接电脑未弹出设备
      
      810 000
   }
   
   车董问题{
       CD-N88_带wifi-ZTOP_S-2083-夜视-HX_US-720P_L-3049_LA-英语_R-4K_P-中性白车_IR-自动_v125_20260825-1933
       N88_1.2.6_wifi_中性_L-NV3049F_LA-泰语-1080P_固定录像1080P_中性_小核_无缩时_20260530_v138
   
       默认4K,2k,1080，插值1080；
       默认英文，
   }
   
   LZ106需求{
       4、是忘上下两个方向移动吗？
       8、空位是最后一个，语言重新排列是什么意思？
       11、不是有拍照张数吗，没有明白
       14、优化录像内存的是什么意思？
   }
   
   旋转{
       hx360x_camera_sdk_v0.0.5_20260717
       这个开关机和充电界面是跟随摄像头旋转吗，能不能改成不跟随，跟屏显旋转
   }
   
   LZ106{
       3、开关机logo需要更换；//done
       4、主界面的时间和电池等图标向外移动//done
       5、循环录像和自动关屏冲突（假设都设置三分钟关屏，录制时间达到三分钟就会熄屏）
       6、录像模式：下键的按键音不同
       7、拍照和录像与画面被拉伸//done
       8、设置中语言设置有空位
       9、软件版本空白
       10、恢复出厂设置不是英文
       11、插入内存卡拍照右上角显示拍照依次增加，更改为剩余拍照数量
       12、储存器模式/PC摄像/视频模式三种模式
       15、设置界面不要留白；
       16、水印不靠下；
       17、缩小为2M falsh；//done
       
       已经处理：3、4、5、6、7、8、9、10、11、12、15、16、17、
       优先处理：
       稍后处理：
       客户回复：
   }
   
   YXM{
       1、视频看着卡卡的，3502E+阿沃拉，不带WiFi
       2、视频严重的时候会没声音
       3、播放资源生成的音频会破音（概率，很小复现）
       
       1、
   }
   
   徒步{
       AVora 2.4.0 3502E,播放视频，声音异常，帮忙看看。
       @海晨 改版thinkplus  开关机画面和水印，WIFI名称改成T830
   }
   
   截摄像头{
       320,
       172,
       
       1280,
       688,
   }
   
   王总问题{
       硬件，
       信号线，
       频率，
       挑卡，写不过来，卡速度慢
   }
   
   开始和结束{
       (720 - 688) / 2
       720 - (720 - 688) / 2
       720 / 2 + 688 / 2
       (720 + 688) / 2
   }
   
   主板{
       3506 20
   }
   
   优先级{
       X10,
       HY168,
       CM13-BMS,
       LZ106,
       X1-500,
   }
   
   X10{
       1、内存照片，需要是67张；
       2、新主板回放，左上角被字体覆盖；
       3、拍照效果问题；
       4、派电源键切换录像模式；
       5、特效需一致，多格连拍5，特效滤镜6，大图贴5；
       6、需要添加屏幕亮度功能；
       7、自动关屏，需要一致；
       8、分辨率需要一致；
       9、图像质量需要一致；
       10、系统音量需要一致；
       11、自动关机需要一致；
       12、软件版本；
       13、三种模式；
       14、剩余拍照数量；
       15、充电测试；
       16、补光灯需要一致；
       
       已经处理：1、2、4、6、7、8、9、10、11、12、14、15、16、
       优先处理：
       稍后处理：5、13、
       IQ处理：3、
       客户回复：
       
   }
   
   录像问题{
       1、录像59s，UI不走；
       2、上电打开WiFi；
   }
   
   屏异常{
       1、对比下驱动看看；
       2、换其他机器正常的屏确认；
   }
   
   位移{
       1 << 18
       2的18次方
   }
   
   0204{
       TF 卡后面USB11；
   }
   
   0204-XAK{
       1.WIFI 选项帮我放在菜单第一页
       2.界面的右下角几个图标帮我放在右上角，右上角的时间去掉把图标放上去。
       3.分辨率帮我默认1080P 的 
       4.拔电的时候显示的是英文字，不是泰文的
   }
   
   N88送样{
       N88_NEWSDK_不带wifi_ARMORALL开机画面_L-S6E63J0_LA-英语-1080P_测试录像卡死问题_20260204_v120
       要求：
       1.分辨默认显示1080.
       菜单有
       2k，
       1080
       720
       2,2083镜头
       3.版本号日期，初始化日期同步当天
       4app同步分辨率，版本号
       开机画面 语言 屏幕型号；其他应该和这个版本一致
   }
   
   