独白{
	感觉有点累了，老妈回老家了，为什么会累呢，
	没有很累，但是不开心，太持续了，或者思考太多了，
	身病易治，心病难医；
	是心净了，是更专注了，开始思考了；
	思考最不需要时间，因为只需一瞬；
	又最需要时间，因为需要积累；
}

json{
	常用密码：Cjs416@JSON
	
	uu密码：Cjs416JSON
	
	多屏移动窗口：win+shift+左移按键；
}

目标{
	可调整，正在尝试的目标{
		1、学学英语{
			一周学7个词汇；
			20260420：在坚持；
			20260512：在坚持；
		}
		2、通关这是我的战争{
			目标：通关我的战争；
		}
	}
	四目标{
		1、积累经验；短期目标；
		2、成为管理；一阶段目标；
		3、成立公司；二阶段目标；
		4、成立国家；三阶段目标，最终目标；
	}
}

投资{
	投资{
		每月：20%-30%；2600-3900；
		宽基指数：2600x0.3=780；
		黄金：2600x0.4=1040
		铜：2600x0.3=780;
	}
	
	计算{
		（1247-1031）/ 1247=17%；
		| 回撤      | 参考     |
		| ------- | ------ |
		| <5%     | 不便宜    |
		| 5%~10%  | 可以慢慢买  |
		| 10%~15% | 偏合理    |
		| >15%    | 可能明显回调 |
		
		20%：定投；
		30%：投入1到1.5；
		50%：投入1.5到2；

	}
}

vsode AI插件{
	GitHub Copilot Chat
	GitHub Copilot
}

这是我的战争{
	什么时候需要结束{
		1、人物死亡；
		2、人物崩溃；
	}
	每日必做{
		早上安排人睡觉（交易姐优先）；
		商人在12点前过来（需要交易获得的东西：木头，组件，火材，水，糖，食物，）；
		11天，吃饭；
		11，13，15，17，19，21，23，25，27，29，31，33，35.37，39，41，43，45，
		18号探索，
		18，21，24，27，30，33，36，39，42，45
		每日白天记录{
			1，需要制作的东西，需要的材料；
			2，今天吃饭的情况；
		}
		每日晚上记录{
			1，记录外界的情况；
			2，记录晚上的交易情况；
		}

	}
	状态信息{
		吃饱，	饥饿，	 非常饥饿，饥饿难忍，	饿得要死，
		正常，	疲劳，	 非常疲劳，精疲力尽，
		健康，	小病，	 生病，	   重病，		病入膏肓，
		健康，	小伤，	 受伤，	   重伤，		致命伤，
		满足， 	无状态， 悲伤，	   沮丧，		崩溃，
		高危组合：非常饥饿+悲伤；寒冷+小病；
	}
	当前进程{	
		1{
			白天{
				1：缺	12个组件升级工作台；
				2：不吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天交易；
			}
		}
		
		2{
			白天{
				1：缺3个组件修补洞；
				2：不吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天探索；
			}
		}
				
		3{
			白天{
				1：缺3个组件修补洞；
				2：不吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天交易；
			}
		}
		
		4{
			白天{
				1：缺组件做烟；
				2：不吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天探索；
			}
		}
				
		5{
			白天{
				1：缺组件做烟；
				2：不吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天交易；
			}
		}
						
		6{
			白天{
				1：缺组件做烟；
				2：吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天交易；
			}
		}
								
		7{
			白天{
				1：缺组件做酒；
				2：
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天探索；
			}
		}
										
		8{
			白天{
				1：缺组件做床；
				2：吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天交易；
			}
		}
		
		9{
			白天{
				1：缺组件做床；
				2：吃饭；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天交易；
			}
		}
		
		10{
			白天{
				1：缺组件做床；
			}
			晚上{
					1，军队可去，汽修店可去；
					2，今天探索；
			}
		}
				
		11{
			白天{
				1：缺水做酒精；
			}
			晚上{
					1，军队不可去，汽修店可去；
					2，今天交易；
			}
		}
						
		12{
			白天{
				1：缺水做酒精；
			}
			晚上{
					1，军队不可去，汽修店可去；
					2，今天探索；
			}
		}
		
		13{
			白天{
				1：缺水做酒精；
			}
			晚上{
					1，军队不可去，汽修店可去；
					2，今天交易；
			}
		}
				
		14{
			白天{
				1：缺水做酒精；
			}
			晚上{
					1，军队不可去，汽修店可去；
					2，今天探索；
			}
		}
						
		15{
			白天{
				1：缺水做酒精；
			}
			晚上{
					1，军队不可去，汽修店可去；
					2，今天交易；
			}
		}
									
		16{
			白天{
				1：缺水做酒精；
			}
			晚上{
					1，军队不可去，汽修店可去；
					2，今天探索；
			}
		}
	}
}









 
