print{
    deg_Printf("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
    hx_printk("JSON: line: %d, func: %s\n",__LINE__,__FUNCTION__);
        
   //JSON-----------------------START:
   
   //JSON-------------------------END
   
    //JSON-TIPS：某些客户不需要升级后自动格式化功能
   }
   
   Avora{ 
   OR1K_GCC_PATH = r'D:\ChenJianShun\02_software\24_toolchain\hx330x-gcc-elf-newlib-sf-mingw-V4.9.1\bin'
   XUANTIE_900_GCC_PATH = r'D:\ChenJianShun\02_software\24_toolchain\Xuantie-900-gcc-elf-newlib-mingw-V3.0.1\bin'
       # ENV_NAME = 'hx350x_or1k'
       ENV_NAME = 'hx350x_riscv'
       #include "user.h"
   }
   
   读盘模式{
       u32 usb_mode;
       res_image_show(R_ID_IMAGE_PCCAM_MODE, 1);
       usb_mode = USB_DEVTYPE_COMBINE;
       usbDeviceOp.ui_show_state = 0;
       task_com_sound_wait_end();
   
       dusb_api_Init(usb_mode);
       usbDeviceOp.usb_process_flag = 1;
   }
   
   other{
       git reset --soft HEAD^
       Cjs416@JSON
       12306：Cjs416JSON
       小写转大写：
       Ctrl + Shift + U
       大写转小写：
       Ctrl + U
       cd /d D:\Projects\Test
       深圳市宝安区新安街道留仙二路D地段F栋新东兴商务中心301。陈海熊，13826597116
   }
   
   一周项目{				
       20260810{
           未完成{
               Y300-XAK,//点亮
               H6365,//
           }
           已完成：
           在做：
           等待{
               等待客户{
               504A1-BH,//添加按键，等待客户确认；
               Y17-ShenDK,//3303需求，等待客户确认，
               H0694-YC,//卡顿问题，等修改车内帧率
               H0694-XAK,//点屏，
               H0654-XAK,//合3049屏驱动，
               8405-LMT-CD,//添加缩时录影；
               H0694-YC,//功能需求,
               H0694-TB,//缩时录影时间
               HP181-HC,//更新SDK，
               H0694-3lu-TB,//等待客户升级，
               GJK100-XAK,//点RGB 3.16的屏
               H0894-HC,//3508E，录像问题，
               84A3-BH,//屏的问题，
               N82-CD,//水印问题，
               H0634-HC,//ASR usb闪的问题，切到最新测试，
               N88-CD,//添加缩时录影,
               9049-35-CD,//后拉；
               84A3-newUI-BH,//卡顿
               84A3-oldUI-BH,//噪点
               84A2-BH,//
               }	
               等待硬件
               H0812-HC,//修改电压输入，
               H0620-HC,//修改电压输入，
               等待原厂
               9049-33-CD,//停车唤醒异常的问题，
               等屏厂支持
               等sensor厂支持
               N89-CD,//添加缩时录影,
           }
       }
   }
   
   金子{
       1141.24 * 0.1 = 114.124;
       1141.24 - 114.124 = 1027.116;
       
       1247x10%=124.7;
       1247-124=1123;
       
       872:2K;
   }
   
   待购买的东西{
   
   }
   
   电池{
       //0 <= b < 1:关机
       //1 <= b < 2：BATTERY_STAT_1
       //2 <= b < 3：BATTERY_STAT_2
       //3 <= b < 4：BATTERY_STAT_3
       //4 <= b < 5：BATTERY_STAT_4
   }
   
   独白{
       在持续混乱中，依然能维持秩序感；
       执行模式改为调度模式；
       一段时间只推进一个核心任务
       统一回复消息
       给自己连续专注时间
       哪些在做
       哪些等待
       哪些暂停
       哪些需要反馈
       哪些先给阶段结果
       
       首先，我应该暂停看消息，专注处理问题，
       可实现但又有挑战的新目标
   }
   
   屏IO口{
       CLK(WR) :     PF0
       RS(HS)  :     PF1
       CS(DE)  :     PF3
       TE(VS)        PF2
       --------      
       D0      :     
       D1      :     
       D2            
       D3            
       D4            
       D5            
       D6            
       D7            
   }	
   
   维护项目{
       done @海晨  需求 :84A3不带WIFI 优化黑点，录像卡顿，版本更新语言默认俄文，分辨率默认4k。
       done 需求2： 84A3 WIFI  +GPS   这个版本上更新语言默认西班牙，分辨率改默认2K。BH-84A3_带wifi-ASR_L-FL7707_S-DVP-2083_LA-印尼语_R-4K_P-welcome_T010_20260818-1410
       done @海晨 陈工那个84D5的软件，那个314A的exp和gain值的函数应该不对，照外面室外是白，你那边检查一下，还有就是这个OV7670的效果那边觉的比较模糊，色彩度不够，可以让章工调一下吗
       done 这个软件帮我改个中性  泰文的软件给我，也改个中文  和  英文 的也要
   }
   
   
   
   华创项目{
       1、H0654,H0634换RGB屏;优先搞1，Y100,
       2、H0812,无屏，摩托车，3508E，
       3、H0620,带屏，摩托车，3506F,
       4、H0635,5路，7701，3506F,优先搞2，
       5、H0892,3508E,双分屏压缩，不读卡，
       6、H06165,3.16屏幕,
   }
   
   wifi pos组{
       wifi_clk:	
       wifi_CMD:	
       wifi_D0:	
       wifi_D1:	
       wifi_D2:	
       wifi_D3:	
   }
   
   郭总项目{
       Y17-3303,
       GJK100,3506,4lu,RGB,3.16,H0654,//改3.16的屏，
       XC403,H0635,//少一个dvp镜头，做4路，
       H0694-XAK,
   }
   
   影路达项目：{
       影路达：
       已完成，客户确认：
       H06165,/*王工已更新完，*/ H0635,/*王工已更新完，*/ H0620,H0892-902,H0634,/*usb问题，*/ H0842,
       
       在处理：
       摩托车：
       H0620,//原厂看
       H0812,//硬件在看
       
       流媒体：
       H0892-903,//3508E,
       H06364-HC,//3502E,
       
       
       锋生：
       sy02,//洪工在确认
   }
   
   飞线{
       黄色：reset;
       红色：VDD;
   }
   
   车董N89需求{
       图标和字体都太小了
       回放界面的水印跑中间了 @海晨 陈工
   }
   
   N89字体{
       字体大小：小一；
       颜色：ee19ff
   }
   
   车董需求{
       9.66软件要求
       1四录带WiFi 带重力感应（默认关闭）
       2默认显示分辨率2K，
       3默认语言俄文-
       定制开机画面
        @海晨 陈工帮忙合一下软件
   }
   
   现有需求{
       车董；
       百华；
       郭总；
   }
   
   开关机{
       DOCMOC
   }
   
   IO口异常{
       camera 0.0.21 IO口复位波形异常，能帮忙确认下这个波形是正常的吗？
   }
   
   9049问题{
       测试20260826：
       1.开机和关机画面需要改
       2.运行一段时间，屏幕出现条纹缓慢刷屏
       3.关机画面异常，出现多个byebye  并且再次开机线出现byebye
       4.点击右侧上锁按钮会自动进入录像模式，关闭上锁后无法重新打开锁问题
       5.按键操作不流畅，特别是开始结束录像和切换画面，切换后需要等待1-2秒才允许按键操作
       新增问题：
       8.界面风格能否和前3代一样，包括菜单界面
       9.菜单选项需要设计和前3代一样
       9.录像过程中点击菜单按钮无法进入菜单，需要自动保存并进入菜单
       10.喇叭声音太小，无按键提示音，开开机音乐，关机音乐
       11.文件保存目录名称和格式也需要和前3代一样
       12.USB连接电脑未弹出设备
   }
   
   
   